Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This only works on fonts added using font_add().
zh_cn: 这仅适用于使用font_add()添加的字体。

source: This opens an ini_file for reading and/writing.
zh_cn: 这将打开一个ini文件进行读写。

source: This particular function takes three component parts, the hue, the saturation and the value (also know as "luminosity") to create the colour desired.
zh_cn: 这个特殊的函数有三个组成部分，色调、饱和度和值(也称为"亮度")来创建所需的颜色。

source: This particular function takes three component parts, the red, the green and the blue components of the colour that you wish to make.
zh_cn: 这个特殊的函数有三个组成部分，即你想要的颜色的红、绿、蓝分量。

source: This point is added onto the end of the path, irrespective of the position of the point, and the factor is equal to the percentage of path_speed that the following instance actually goes at when it reaches this point in the path.
zh_cn: 该点被添加到路径的末端，与该点的位置无关，并且该乘数等于以下实例在到达路径中的该点时实际达到的path_speed的百分比。

source: This position should be between 0 and 1, and the function will return the curve value at that position, or it will return 0 if the channel struct supplied is invalid.
zh_cn: 此位置应该在0到1之间，函数将返回该位置的曲线值，或者如果提供的通道结构无效，它将返回0。

source: This read only array holds all the ids of every active instance within the room.
zh_cn: 这个只读数组保存房间中每个活动实例的所有id。

source: This read only variable can be used to get the number of sub-images in a sprite that has been assigned to an instance (if you need the number of sub-images for a sprite other than the one assigned to the instance you should use sprite_get_number()).
zh_cn: 这个只读变量可用于获取已分配给实例的精灵中的子图像数量(如果您需要为一个非分配给实例的精灵获取子图像数量，则应该使用sprite_get_number()))。

source: This read only variable is only valid in the Draw Event and returns the current view port being rendered.
zh_cn: 这个只读变量只在Draw Event中有效，并返回正在呈现的当前视图端口。

source: This read only variable returns the current month as a numeric value where 1 is January and 12 is December.
zh_cn: 这个只读变量以数值形式返回当前月份，其中1是一月，12是十二月。

source: This read only variable returns the display name of your game for the target platform in a "save-friendly" format for the target platform.
zh_cn: 这个只读变量在目标平台以"保存友好"的格式返回游戏的显示名称。

source: This read only variable returns the display name of your game for the target platform, as set in the Game Options.
zh_cn: 这个只读变量返回目标平台上游戏的显示名称，就像在game Options中设置的那样。

source: This read only variable returns the height of the sprite that has been assigned to the instance.
zh_cn: 这个只读变量返回已分配给实例的精灵的高度。

source: This read only variable returns the index of the object that the instance has been created from.
zh_cn: 这个只读变量返回创建实例的对象的索引。

source: This read only variable returns the index of the very first room in the game (this is defined by the order in which the rooms appear in the Room Manager and not by the order in which they were created).
zh_cn: 这个只读变量返回游戏中第一个房间的索引(这是由房间在房间管理器中出现的顺序定义的，而不是由它们被创建的顺序定义的)。

source: This read only variable returns the index of the very last room in the game (this is defined by the order in which the rooms appear in the Room Manager and not by the order in which they were created).
zh_cn: 这个只读变量返回游戏中最后一个房间的索引(这是由房间在房间管理器中出现的顺序定义的，而不是由它们被创建的顺序定义的)。

source: This read only variable returns the local xoffset (the x component of the origin as defined in the sprite editor) of the sprite that has been assigned to the instance.
zh_cn: 这个只读变量返回分配给实例的精灵的本地xoffset(精灵编辑器中定义的原点x组件)。

source: This read only variable returns the local yoffset (the y component of the origin as defined in the sprite editor) of the sprite that has been assigned to the instance.
zh_cn: 这个只读变量返回分配给实例的精灵的本地yoffset(精灵编辑器中定义的原点的y组件)。

source: This read only variable returns the mouse button that is currently being pressed (currently, as in, this step) and can return any of the special mouse constants except mb_any.
zh_cn: 这个只读变量返回当前被按下的鼠标按钮(当前，在这个步骤中),并且可以返回除mb_any之外的任何特殊鼠标常量。

source: This read only variable returns the position (along the x-axis) within the room of the left hand bounding box for the instance, where the bounding box is defined by the maximum width and height of the mask for the instance (as set by the sprite_index or by the mask_index).
zh_cn: 这个只读变量返回实例的左侧边界框的位置(沿x轴)，其中边界框由实例的掩码的最大宽度和高度定义(由sprite_index或mask_index设置)。

source: This read only variable returns the position within the room (along the x-axis) of the right hand side of the bounding box for the instance, where the bounding box is defined by the maximum width and height of the mask for the instance (as set by the sprite_index or by the mask_index).
zh_cn: 这个只读变量返回实例的边界框右侧在房间内(沿x轴)的位置，其中边界框由实例的掩码的最大宽度和高度定义(由sprite_index或mask_index设置)。

source: This read only variable returns the position within the room (along the y-axis) of the top of the bounding box for the instance, where the bounding box is defined by the maximum width and height of the mask for the instance (as set by the sprite_index or by the mask_index).
zh_cn: 这个只读变量返回实例的边界框顶部在房间内(沿y轴)的位置，其中边界框由实例的掩码的最大宽度和高度定义(由sprite_index或mask_index设置)。

source: This read only variable returns the unique identifier for the game you have created.
zh_cn: 这个只读变量返回你所创建的游戏的唯一标识符。

source: This read only variable returns the width of the sprite that has been assigned to the instance.
zh_cn: 这个只读变量返回已分配给实例的精灵的宽度。

source: This read only variable returns the y position (within the room) of the bottom of the bounding box for the instance, where the bounding box is defined by the maximum width and height of the mask for the instance (as set by the sprite_index or by the mask_index).
zh_cn: 这个只读变量返回实例的边界框底部的y位置(在房间内)，其中边界框由实例的掩码的最大宽度和高度定义(由sprite_index或mask_index设置)。

source: This read only variable returns true when the game is being played in debug mode and false when being played as normal.
zh_cn: 当游戏在调试模式下运行时，这个只读变量返回true，当正常运行时返回false。

source: This read only variable will return the current year.
zh_cn: 这个只读变量将返回当前年份。

source: This read only variable will return the day as a value from 1 to 31, depending on the month.
zh_cn: 这个只读变量将返回1到31之间的值，具体取决于月份。

source: This read only variable will return the hour that corresponds to the current moment based on the default time zone for the system (ie: local time).
zh_cn: 这个只读变量将根据系统的默认时区(即:本地时间)返回与当前时刻对应的小时。

source: This read only variable will return the minutes that correspond to the current moment.
zh_cn: 这个只读变量将返回与当前时刻对应的分钟数。

source: This read only variable will return the number of milliseconds that have passed since the game was started.
zh_cn: 这个只读变量将返回自游戏启动以来所经过的毫秒数。

source: This read only variable will return the seconds that correspond to the current moment.
zh_cn: 这个只读变量将返回与当前时刻对应的秒数。

source: This read only variable will return the weekday as a value, where Sunday is 0 and Saturday is 6.
zh_cn: 这个只读变量将返回工作日作为值，其中Sunday为0,Saturday为6。

source: This read-only array returns the x position of all points detected in a collision between two physics enabled instances.
zh_cn: 这个只读数组返回在两个启用物理的实例之间的碰撞中检测到的所有点的x位置。

source: This read-only array returns the y position of all points detected in a collision between two physics enabled instances.
zh_cn: 这个只读数组返回在两个启用物理的实例之间的碰撞中检测到的所有点的y位置。

source: This read-only variable holds one of various constant GameMaker has to tell you which operating system the game has been created for.
zh_cn: 这个只读变量包含各种常量之一，GameMaker必须告诉你游戏是针对哪个操作系统创建的。

source: This read-only variable holds one of various constant values listed below to tell you which device you are currently running the game on.
zh_cn: 这个只读变量包含下面列出的各种常量值之一，告诉你当前在哪个设备上运行游戏。

source: This read-only variable holds one of various constants (listed below) that GameMaker has to tell you which browser you are currently running the game in (if any).
zh_cn: 这个只读变量包含GameMaker告诉你当前游戏运行在哪个浏览器(如果有的话)的各种常量之一(如下所示)。

source: This read-only variable holds the unique identifying number for the instance.
zh_cn: 这个只读变量保存实例的唯一标识号。

source: This read-only variable indicates whether the object is managed by the rollback multiplayer system or not.
zh_cn: 此只读变量指示该对象是否由回滚多人游戏系统管理。

source: This read-only variable returns object index of the instance which is running the event being checked.
zh_cn: 这个只读变量返回运行被检查事件的实例的对象索引。

source: This read-only variable returns the current speed of the physics enabled instance, defined in pixels per step.
zh_cn: 此只读变量返回启用物理的实例的当前速度，以每步像素为单位定义。

source: This read-only variable returns the current x axis position of the mouse within the room.
zh_cn: 这个只读变量返回鼠标在房间内的当前x轴位置。

source: This read-only variable returns the current y axis position of the mouse within the room.
zh_cn: 这个只读变量返回鼠标在房间内的当前y轴位置。

source: This read-only variable returns the mass of the instance in kilograms.
zh_cn: 此只读变量以千克为单位返回实例的质量。

source: This read-only variable returns the number of points of collision detected between the two objects in the collision
zh_cn: 这个只读变量返回碰撞中两个对象之间检测到的碰撞点的数量

source: This read-only variable returns the number of the event currently being called, where the number is actually referring to the "sub event" of the event, ie: for the step event the event number could be any one of the constants ev_step_normal, ev_step_begin, or ev_step_end.
zh_cn: 这个只读变量返回当前正在调用的事件的编号，其中该编号实际上是指事件的"子事件",即:对于step事件，事件编号可以是常量ev_step_normal、ev_step_begin或ev_step_end中的任何一个。

source: This read-only variable returns the type of event currently being executed, which can be one of the following constants:
zh_cn: 此只读变量返回当前正在执行的事件类型，可以是下列常量之一:

source: This read-only variable returns the x component of the collision normal corresponding to the phy_collision_x array value.
zh_cn: 这个只读变量返回与phy_collision_x数组值对应的碰撞法线的x分量。

source: This read-only variable returns the y component of the collision normal corresponding to the phy_collision_y array value.
zh_cn: 这个只读变量返回与phy_collision_y数组值对应的碰撞法线的y分量。

source: This read-only variable returns whether or not the instance is currently "sleeping" (true) or not (false), A "sleeping" instance is one that is not actively engaged in any physical simulation.
zh_cn: 该只读变量返回实例当前是否"休眠"(true)或"非休眠"(false)，"休眠"实例是不主动参与任何物理模拟的实例。

source: This read-only variable will return the full path ID of the directory that is used by your game to save files to.
zh_cn: 这个只读变量将返回你的游戏用来保存文件的目录的完整路径ID。

source: This read-only variable will return the x position of the instance's center of mass.
zh_cn: 这个只读变量将返回实例重心的x位置。

source: This read-only variable will return the y position of the instance's center of mass.
zh_cn: 这个只读变量将返回实例重心的y位置。

source: This read-only variable will return true if the instance is classed as being a kinematic object, or false if it is not.
zh_cn: 如果实例被归类为运动学对象，则该只读变量将返回true，否则返回false。

source: This read-only variable will return whether WebGL is enabled (true) or not (false) for your game.
zh_cn: 这个只读变量将返回你的游戏是否启用了WebGL。

source: This region can either be flagged as "inside" or "outside" as demonstrated in the following image:
zh_cn: 这个区域可以被标记为"内部"或"外部"，如下图所示:

source: This runtime function can be used to "take over" the default GameMaker error message when a runtime exception occurs.
zh_cn: 当运行时异常发生时，这个运行时函数可以用来"接管"默认的GameMaker错误消息。

source: This setting will affect how much an object "bounces" when it collides with other objects and is co-dependent on other forces that act on the instance like gravity and friction, and is usually a value between 0 and 1 (higher values can be used but may give unpredictable results).
zh_cn: 该设置将影响对象与其他对象碰撞时"反弹"的程度，并与作用在实例上的其他力(如重力和摩擦力)相关，通常为0到1之间的值(可以使用更高的值，但可能会产生不可预测的结果)。

source: This should always be called when the system is no longer needed, like at the end of a room, or in the destroy event of an instance, otherwise you could end up with particles appearing in later rooms and no way to remove them as well as a memory leak which will eventually crash your game.
zh_cn: 当系统不再被需要时，比如在一个房间的尽头，或者在一个实例的销毁事件中，应该总是调用此函数，否则你可能会在后面的房间中出现粒子，没有办法移除它们，以及最终会使你的游戏崩溃的内存泄漏。

source: This should always be done whenever the emitter is not going to be used further in the room or the game, ie: in the Destroy Event of the instance or in the Room End Event, otherwise you may end up with a memory leak that will slow down and eventually crash your game.
zh_cn: 这应该总是在发射器不打算在房间或游戏中进一步使用时进行，例如:在实例的Destroy事件或在房间结束事件中，否则你可能会以内存泄漏结束，从而减慢速度并最终崩溃你的游戏。

source: This should be done whenever the file in question is no longer needed in the game, normally (for example) in a Game End event.
zh_cn: 当有问题的文件在游戏中不再需要时，这应该被执行，通常(例如)在游戏结束事件中。

source: This should normally go in the step event of an instance, but can be used selectively in a collision event too, as illustrated by the code example below.
zh_cn: 这通常应该放在实例的步骤事件中，但也可以选择性地在碰撞事件中使用，如下面的代码示例所示。

source: This should normally go in the step event of an instance, but can be used selectively in a collision event too.
zh_cn: 这通常应该放在实例的步骤事件中，但也可以选择性地在碰撞事件中使用。

source: This simple function will draw the current list of internally stored high scores using the currently set font, colour and alpha values within the specified rectangle.
zh_cn: 这个简单的函数将在指定的矩形内使用当前设置的字体、颜色和alpha值绘制内部存储的当前高分列表。

source: This specifies how the playbackSpeed should be interpreted and you can get or set this value.
zh_cn: 这指定了应该如何解释playbackSpeed，并且您可以获取或设置该值。

source: This specifies the playback speed of the sequence, which is interpreted as either frames-per-second or frames-per-game-frame depending on the playbackSpeedType (see below).
zh_cn: 这指定了序列的回放速度，根据playbackSpeedType(见下文)，该速度被解释为每秒帧数或每游戏帧帧数。

source: This string can then be later read back into a new ds_map using ds_map_read().
zh_cn: 之后可以使用ds_map_read()将该字符串读回新的ds_map。

source: This string is hardware dependant and the returned value will depend on the gamepad plugged into the device "slot" that is being checked.
zh_cn: 该字符串依赖于硬件，返回值将依赖于插入正在检查的设备"插槽"的手柄。

source: This string will be either:
zh_cn: 这个字符串可以是:

source: This string will only contain printable characters typed, but it will correctly respond to pressing the backspace key by erasing the last character.
zh_cn: 该字符串将只包含键入的可打印字符，但它将通过擦除最后一个字符来正确响应按退格键。

source: This surface is permanently available and is where the bulk of drawing is done by GameMaker.
zh_cn: 这个表面是永久可用的，也是GameMaker完成大部分绘图的地方。

source: This time will also affect how the Tap Event is triggered as a touch/click and release before this time is up will be considered a Tap.
zh_cn: 该时间还将影响点击事件的触发方式，因为在该时间结束之前的触摸/点击和释放将被视为点击。

source: This time zone can either be local (as set by the system) or UTC, and the function will return one of the following constants:
zh_cn: 该时区可以是本地时区(由系统设置)或UTC时区，此函数将返回以下常量之一:

source: This time zone can either be local (as set by the system) or UTC, and you would use one of the following constants to define which is being used (by default this is local time):
zh_cn: 该时区可以是本地(由系统设置)或UTC，您可以使用以下常量之一来定义使用的是哪一个(默认情况下是本地时间):

source: This type of buffer is to be used as a vertex buffer only.
zh_cn: 这种类型的缓冲区仅用作顶点缓冲区。

source: This type of rounding is called bankers rounding and over large numbers of iterations or when using floating point maths, it gives a statistically better rounding than the more traditional "round up if over .5 and round down otherwise" approach.
zh_cn: 这种类型的舍入被称为银行家舍入，在大量迭代或使用浮点数学时，它比更传统的"如果超过. 5则向上舍入，否则向下舍入"方法在统计上给出更好的舍入。

source: This value can be either 0, positive or minus, where 0 is the left hand side of the room and moving right increases x, moving left decreases x (a negative value for x means that the instance has gone outside the left side of the room).
zh_cn: 该值可以是0、正数或负数，其中0是房间的左侧，向右移动增加x，向左移动减少x(x的负值意味着实例已经超出了房间的左侧)。

source: This value can be either 0, positive or minus, where 0 is the top of the room and moving down increases y, moving up decreases y (a negative value for y means that the instance has gone outside the top of the room).
zh_cn: 该值可以是0、正数或负数，其中0是房间的顶部，向下移动增加y，向上移动减少y(y的负值表示实例已经超出房间的顶部)。

source: This value can be set from 0 to 1 with 0 being fully transparent and 1 being fully opaque (the default value), and will affect all further drawing, including backgrounds, sprites, fonts, primitives and 3D.
zh_cn: 该值可以在0到1之间设置，0表示完全透明，1表示完全不透明(默认值)，并将影响所有进一步的绘制，包括背景、精灵、字体、图元和3D。

source: This value can be used to get or to set the scale of the currently assigned path for the instance (as set by the function path_start()) with a default value of 1.
zh_cn: 该值可用于获取或设置实例当前分配路径的比例(由函数path_start()设置)，默认值为1。

source: This value can change at any time as people plug/unplug microphones or other input sources to the device.
zh_cn: 当插入/拔出麦克风或设备的其他输入源时，该值可以随时改变。

source: This value can then be used in other draw functions, particularly in general 3D and some of the 2D primitive functions.
zh_cn: 这个值可以在其他绘图函数中使用，特别是在一般的3D和一些2D图元函数中。

source: This value can then be used in other draw functions, particularly in general drawing when using primitives as well as the Shader functions.
zh_cn: 这个值可以在其他绘图函数中使用，特别是在使用图元和Shader函数时的一般绘图中。

source: This value can then be used in other draw functions, particularly in the 2D primitive functions, as well as the Shader functions.
zh_cn: 然后，该值可用于其他绘制函数，尤其是2D原始函数以及着色器函数。

source: This value can then be used in other functions like layer_get_depth() or it can be changed to move the instance to another layer, but note that if the layer being assigned does not exist in the current room, then you will get an error that will force your game to close.
zh_cn: 然后，这个值可以用于其他函数，如layer_get_depth()，或者可以更改它以将实例移动到另一个层，但注意，如果正在分配的层在当前房间中不存在，那么您将会得到一个错误，该错误将强制您的游戏关闭。

source: This value is a multiplier, where 1 is the default playback speed and values less than 1 will slow the playback and values larger than 1 will speed it up, eg: a value of 0.5 would be half playback speed, while a value of 2 would be double playback speed.
zh_cn: 这个值是一个乘数，其中1是默认播放速度，值小于1将减慢播放速度，值大于1将加快播放速度，例如:值0.5将是播放速度的一半，而值2将是播放速度的两倍。

source: This value is always positive, and incomplete days will be returned as a fraction.
zh_cn: 这个值总是正的，不完整的天数将作为一个分数返回。

source: This value is always positive, and incomplete hours will be returned as a fraction.
zh_cn: 该值始终为正值，未完成的小时数将以分数形式返回。

source: This value is always positive, and incomplete minutes will be returned as a fraction.
zh_cn: 该值总是正的，不完整的分钟将作为分数返回。

source: This value is always positive, and incomplete months will be returned as a fraction.
zh_cn: 这个值总是正的，不完整的月份将作为分数返回。

source: This value is always positive, and incomplete weeks will be returned as a fraction.
zh_cn: 该值始终为正值，未完成的周数将以分数形式返回。

source: This value is always positive, and incomplete years will be returned as a fraction.
zh_cn: 该值始终为正值，不完整的年份将以分数形式返回。

source: This value is calculated automatically based on the surface area of the assigned fixtures and their density values, but it can be changed using the function physics_mass_properties().
zh_cn: 该值是根据指定装置的表面积及其密度值自动计算的，但可以使用函数physics_mass_properties()进行更改。

source: This value is given as a relative value based on the upper left corner of the base sprite asset being (0,0).
zh_cn: 该值是基于基础sprite资源左上角(0，0)的相对值。

source: This value is the number of cells the grid has along the x-axis and is always an integer, as shown in the image below:
zh_cn: 该值是网格在x轴上的单元数，并且始终是一个整数，如下图所示:

source: This value is the number of cells the grid has along the y-axis and is always an integer, as shown in the image below:
zh_cn: 这个值是网格沿y轴的单元格数，总是一个整数，如下图所示:

source: This value must be between 1 and 8, with a low value creating straighter edges with sharper curves between points, while a higher value will round the points and make the path a lot more "curvy".
zh_cn: 该值必须介于1和8之间，低值会创建更直的边缘，点与点之间的曲线更尖锐，而高值会使点变圆，使路径更加"弯曲"。

source: This value needn't be a defining point of the path, it can be anywhere on it.
zh_cn: 这个值不必是路径的定义点，它可以是路径上的任何位置。

source: This value sets the angle (rotation) of the sprite and is measured in degrees, with the right being 0º, up being 90º, left being 180º and down being 270º.
zh_cn: 这个值设置了精灵的角度(旋转)，以角度来衡量，右为0º，上为90º，左为180º，下为270º。

source: This value sets the horizontal scaling applied to the sprite that has been assigned to the current instance.
zh_cn: 该值设置应用于已分配给当前实例的精灵的水平缩放。

source: This value sets the vertical scaling (along the y-axis) applied to the sprite that has been assigned to the current instance.
zh_cn: 该值设置应用于已分配给当前实例的精灵的垂直缩放(沿y轴)。

source: This value should be stored in a variable and used in all further function calls relating to the list.
zh_cn: 这个值应该存储在一个变量中，并在所有与列表相关的函数调用中使用。

source: This value should be stored in a variable and used in all further function calls relating to the priority queue.
zh_cn: 这个值应该存储在一个变量中，并在与优先队列相关的所有进一步函数调用中使用。

source: This value should be stored in a variable and used in all further function calls relating to the queue.
zh_cn: 这个值应该存储在一个变量中，并在所有与队列相关的函数调用中使用。

source: This value should be stored in a variable and used in all further function calls relating to the stack.
zh_cn: 这个值应该存储在一个变量中，并在与堆栈相关的所有后续函数调用中使用。

source: This value will affect all further drawing where appropriate, including fonts, forms, primitives and 3D.
zh_cn: 该值将影响所有适当的后续绘图，包括字体、表单、图元和3D。

source: This value will be between 0 and 360, where 0 represents right, 90 up, 180 left and 270 down.
zh_cn: 这个值将在0到360之间，其中0表示右，90表示上，180表示左，270表示下。

source: This variable can be read to find out if the instance is flagged as persistent or not, or it can used to set persistence to true (persistent) or false (not persistent) for the instance.
zh_cn: 可以读取该变量，以确定实例是否被标记为持久，或者可以使用该变量将实例的持久性设置为true(持久)或false(非持久)。

source: This variable can be used to find out if a particular view port is currently visible or not.
zh_cn: 该变量可用于确定特定的视口当前是否可见。

source: This variable can be used to find the sprite_index of that mask (or it will return -1 if no sprite has been assigned) or to set the mask for an instance to the chosen sprite.
zh_cn: 这个变量可以用来找到该掩码的sprite_index(或者如果没有分配精灵，它将返回-1)，或者为一个实例设置所选精灵的掩码。

source: This variable can be used to get (or to set) the angle of the instances fixture in degrees, similar to setting or getting the image_angle.
zh_cn: 该变量可用于获取(或设置)实例夹具的角度，单位为度，类似于设置或获取image_angle。

source: This variable can be used to get (or to set) the previous x position of the instance within the game room physics world.
zh_cn: 该变量可用于获取(或设置)游戏房间物理世界中实例的前一个x位置。

source: This variable can be used to get (or to set) the previous y position of the instance within the game room physics world.
zh_cn: 该变量可用于获取(或设置)游戏房间物理世界中实例的前一个y位置。

source: This variable can be used to get (or to set) the x position of the instance within the game room physics world.
zh_cn: 该变量可用于获取(或设置)游戏房间物理世界中实例的x位置。

source: This variable can be used to get (or to set) the y position of the instance within the game room physics world.
zh_cn: 该变量可用于获取(或设置)游戏房间物理世界中实例的y位置。

source: This variable can be used to get and to set the persistent flag for the current room.
zh_cn: 该变量可用于获取和设置当前房间的永久标志。

source: This variable can be used to get or change the x component of the instance's linear speed vector and is defined in pixels per step (for pixels per second, see phy_linear_velocity_x).
zh_cn: 该变量可用于获取或更改实例的线速度向量的x分量，并以每步像素数定义(有关每秒像素数，请参见phy_linear_velocity_x)。

source: This variable can be used to get or change the x component of the instance's linear velocity vector and is defined in pixels per second (for pixels per step, see phy_speed_x).
zh_cn: 该变量可用于获取或更改实例的线速度向量的x分量，并以每秒像素数定义(有关每步像素数，请参见phy_speed_x)。

source: This variable can be used to get or change the y component of the instance's linear speed vector and is defined in pixels per step (for pixels per second, see phy_linear_velocity_y).
zh_cn: 该变量可用于获取或更改实例的线速度向量的y分量，并以每步像素数定义(有关每秒像素数，请参见phy_linear_velocity_y)。

source: This variable can be used to get or change the y component of the instance's linear velocity vector and is defined in pixels per second (for pixels per step, see phy_speed_y).
zh_cn: 该变量可用于获取或更改实例的线速度向量的y分量，并以每秒像素数定义(有关每步像素数，请参见phy_speed_y)。

source: This variable can be used to get or to change the reaction of an instance when it reaches the end of the current path.
zh_cn: 此变量可用于获取或更改实例到达当前路径末尾时的反应。
